// Напишите программу, которая на вход принимает число и выдает его квадрат (умножает само на себя)

Console.WriteLine("Write a number: ");
string s_a = Console.ReadLine();

int a = int.Parse(s_a);
Console.WriteLine(a * a);


