// напишите программу, которая будет выдавать название дня недели по заданному номеру


Console.WriteLine("Write a number a: ");
int a = int.Parse(Console.ReadLine());

Console.WriteLine("Write a number b: ");
int b = int.Parse(Console.ReadLine());

if (a * a == b)
Console.WriteLine("Да");
else 
Console.WriteLine("Нет");
